camel/camel-exercise-webservice/target/classes/data/soap-get-a-customer.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tra="http://training.fusesource.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <tra:getCustomerByName>
         <name>Fuse</name>
      </tra:getCustomerByName>
   </soapenv:Body>
</soapenv:Envelope>